# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне - слева короткие слова дополняем символами пробела

# Исходные данные:
fruits = ["яблоко", "банан", "киви"]
el_max = max(fruits)

for i, el in enumerate(fruits, 1):

    if el == el_max:
        print(i, '. ', el, sep='')
    else:
        print(i, '. ', ' '*(len(el_max)-len(el)) + el, sep='')

# Пример вывода:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Важно! Ваше решение должно работать с любыми корректными "исходными данными"
# Проверьте это, добавив или удалив несколько элементов списка
