# Даны координаты центров двух окружностей (x1; y1) (x2; y2) и и их радиусы  R1 и R2.
# Находится ли одна окружность целиком внутри другой

def distance(x1, y1, x2, y2):

    d = ((x2 - x1)**2 + (y2 - y1)**2)**0.5
    return d

O1 = (81, 5)
O2 = (81, 5)
R1 = 5
R2 = 10

if abs(R2-R1) > distance(*O1, *O2):
    print('YES')
else:
    print('NO')
